In [23]:
 import pandas as pd

In [24]:
df=pd.read_csv("employees.csv")

In [25]:
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [26]:
df.shape

(6, 4)

In [27]:
row,col=df.shape
print(row)

6

In [28]:
row,col=df.shape
print(col)

4

In [29]:
row,col=df.shape
print(col,row)

4 6

In [31]:
df["Name"]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [32]:
df["Salary"].max()

250

In [33]:
df["Salary"].min()

50

In [34]:
df["Name"][df["Salary"]==250]

4    Sam Allardyce
Name: Name, dtype: object

In [40]:
data={'Name':["sirisha","karthik","priya","lakshmi","jyothi"],
    'salary':[100000,200000,500000,400000,600000]}

In [41]:
data

{'Name': ['sirisha', 'karthik', 'priya', 'lakshmi', 'jyothi'],
 'salary': [100000, 200000, 500000, 400000, 600000]}

In [42]:
import pandas as pds

In [44]:
dict_df=pd.DataFrame(data)

In [46]:
dict_df

      Name  salary
0  sirisha  100000
1  karthik  200000
2    priya  500000
3  lakshmi  400000
4   jyothi  600000

In [51]:
dict_df["Name"]

0    sirisha
1    karthik
2      priya
3    lakshmi
4     jyothi
Name: Name, dtype: object

In [53]:
dict_df["salary"].max()

600000

In [59]:
dict_df["Name"][dict_df["salary"].max()]

KeyError: 600000

In [55]:
dict_df.to_csv("emp.csv")

In [65]:
dict_df.to_excel("emp.xlsx")

In [66]:
datafra=pd.read_excel("emp.xlsx")

In [67]:
datafra

   Unnamed: 0     Name  salary
0           0  sirisha  100000
1           1  karthik  200000
2           2    priya  500000
3           3  lakshmi  400000
4           4   jyothi  600000